# Project using Numpy and Pandas libraries in Python

In this project, I am creating and manipulating the data of employees for a company, to accomplish this I have made some questions. After solving each question we will have structured information about all the employees that can be used in future.
•	I have used numpy and pandas libraries.
•	Used various operator like +(addition),~(logical not).
•	Create and manipulate data frame.

In [1]:
### importing numpy and pandas librries 
import numpy as np 
import pandas as pd

### Q-1) MegaCity Builders is a construction company. They seek the help of their data analyst to generate employee codes from 1 to 1,000 for their part-time work force, as they are not interested in the RDBMS solution
   
   .

In [2]:
megacity = pd.DataFrame()

In [3]:
megacity['empl_code'] = np.arange(1,1001)

In [4]:
megacity.head()

   empl_code
0          1
1          2
2          3
3          4
4          5

### Q-2) The company decides to give cash bonus to its employees on Christmas.  How can you generate the random bonus amounts ranging from 100 USD to 300 USD for the 1,000 employees?

In [5]:
megacity['Bonus (USD)'] = np.random.randint(100,300,1000)

In [6]:
megacity.head()

   empl_code  Bonus (USD)
0          1          102
1          2          253
2          3          123
3          4          117
4          5          125

### Q-3) MegaCity builders has a total of 1,000 part-time employees. The annual salary of these employees lies between 10,000 USD to 20,000 USD. The company wishes to find the average annual salary of employees.

In [7]:
megacity['Salary(USD)'] = np.random.randint(10000,20000,1000)

In [8]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)
0          1          102        18256
1          2          253        17688
2          3          123        17567
3          4          117        17170
4          5          125        11998

In [9]:
avg_salary = megacity['Salary(USD)'].mean()
print(f"Average salary of all the employees of megacity is USD {avg_salary}")

Average salary of all the employees of megacity is USD 14957.849

### Q-4) Print the salaries of all the employees with the bonuses included.

In [10]:
megacity['Total_salary '] = megacity['Bonus (USD)'] + megacity['Salary(USD)']

In [11]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          102        18256          18358
1          2          253        17688          17941
2          3          123        17567          17690
3          4          117        17170          17287
4          5          125        11998          12123

### Q-5) The HR of MegaCity Builders wishes to print those employee IDs that even number.

In [12]:
megacity[megacity['empl_code']%2 == 0]

     empl_code  Bonus (USD)  Salary(USD)  Total_salary
1            2          253        17688          17941
3            4          117        17170          17287
5            6          133        16184          16317
7            8          225        12036          12261
9           10          195        17335          17530
..         ...          ...          ...            ...
991        992          109        18248          18357
993        994          183        15384          15567
995        996          183        19947          20130
997        998          228        10800          11028
999       1000          142        18080          18222

[500 rows x 4 columns]

### Q-6) The company wishes to provide extra bonus of 200 USD to all the employees. How can you add 200 USD to each employee's bonus?

In [13]:
megacity['Bonus (USD)'] = megacity['Bonus (USD)'] + 200

In [14]:
megacity.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          302        18256          18358
1          2          453        17688          17941
2          3          323        17567          17690
3          4          317        17170          17287
4          5          325        11998          12123

###  Q-7) The HR wishes to know how many employees are getting salaries more than 15,000 USD per year.

In [15]:
grtr_15000 = megacity['Salary(USD)'][megacity['Salary(USD)']> 15000].count()
print(f"No. of employess who are getting salary greater tham 15000 USD are {grtr_15000}")

No. of employess who are getting salary greater tham 15000 USD are 500

### Q-8)The employees with the codes 5, 124, 200, 332, 420, 589, 665, 743, 887, and 901 like to resign.As per the policy, the company does not save the data of part-time employees once they have resigned. How can you delete these record/data of employees? Consider the array "dup" to contain a copy of the employee codes.

In [16]:
dup = megacity.copy()

In [17]:
dup.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          302        18256          18358
1          2          453        17688          17941
2          3          323        17567          17690
3          4          317        17170          17287
4          5          325        11998          12123

In [18]:
c_lst = [5,124,200,332,420,589,665,743,887,907]

In [19]:
dup = dup[~dup['empl_code'].isin(c_lst)]

In [20]:
dup.head(10)

    empl_code  Bonus (USD)  Salary(USD)  Total_salary
0           1          302        18256          18358
1           2          453        17688          17941
2           3          323        17567          17690
3           4          317        17170          17287
5           6          333        16184          16317
6           7          456        15350          15606
7           8          425        12036          12261
8           9          478        16451          16729
9          10          395        17335          17530
10         11          439        11832          12071

### Q9) How will you check if the employee with employee id 5 is actually deleted or not?

In [21]:
dup.head(6)

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0          1          302        18256          18358
1          2          453        17688          17941
2          3          323        17567          17690
3          4          317        17170          17287
5          6          333        16184          16317
6          7          456        15350          15606

In [22]:
dup[dup['empl_code']==5]

Empty DataFrame
Columns: [empl_code, Bonus (USD), Salary(USD), Total_salary ]
Index: []

### Q10)The array "dup" now has the employee IDs, after deleting a few employee ID. Delete the employees with employee codes 101 and 201.

In [23]:
d_lst = [101,201]

In [24]:
dup = dup[~dup['empl_code'].isin(d_lst)]

In [25]:
dup[dup['empl_code']==101]

Empty DataFrame
Columns: [empl_code, Bonus (USD), Salary(USD), Total_salary ]
Index: []

In [26]:
dup[dup['empl_code']==201]

Empty DataFrame
Columns: [empl_code, Bonus (USD), Salary(USD), Total_salary ]
Index: []

###  Q-11) The HR wants to hire 10 new employees, assign them the employee codes from 1001 to 1010,and add the data in the existing employee codes. How can you accomplish this task? Consider the array "empl_code" which originally contains the employee ID's

In [27]:
dct1 = {"empl_code":[1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
       "Bonus (USD)":[265, 262, 286, 296, 222, 261, 260, 205, 231, 275],
       "Salary(USD)":[14992,19695,11898,16937,15308,18051,14415,18063,11153,10079],
       }

In [28]:
new_empl = pd.DataFrame(dct1)

In [29]:
new_empl.head()

   empl_code  Bonus (USD)  Salary(USD)
0       1001          265        14992
1       1002          262        19695
2       1003          286        11898
3       1004          296        16937
4       1005          222        15308

In [30]:
new_empl['Total_salary'] = new_empl['Bonus (USD)']+ new_empl['Salary(USD)']

In [31]:
new_empl.head()

   empl_code  Bonus (USD)  Salary(USD)  Total_salary
0       1001          265        14992         15257
1       1002          262        19695         19957
2       1003          286        11898         12184
3       1004          296        16937         17233
4       1005          222        15308         15530

In [32]:
dup.shape

(988, 4)

In [33]:
new_empl.shape

(10, 4)